[
    {
        "title": "A Bayesian optimization framework for the automatic tuning of MPC-based shared controllers",
        "authors": [
            "Anne van der Horst",
            "Bas Meere",
            "Dinesh Krishnamoorthy",
            "Saray Bakker",
            "Bram van de Vrande",
            "Henry Stoutjesdijk",
            "Marco Alonso",
            "Elena Torta",
        ],
        "date": "2024-05-01",
        "type": "conference",
        "venue": "IEEE International Conference on Robotics and Automation (ICRA)",
        "links": [
            {
                "pdf": "https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=10610655"
            }
        ],
        "image": "/assets/images/papers/mscphilips/MscPhilips.png",
        "key_words": [
            "mscphilips"
        ],
        "abstract": "This paper presents a Bayesian optimization framework for the automatic tuning of shared controllers which are defined as a Model Predictive Control (MPC) problem. The proposed framework includes the design of performance metrics as well as the representation of user inputs for simulation-based optimization. The framework is applied to the optimization of a shared controller for an Image Guided Therapy robot. VR-based user experiments confirm the increase in performance of the automatically tuned MPC shared controller with respect to a hand-tuned baseline version as well as its generalization ability."
      },
      {
        "title": " Multi-Robot Local Motion Planning Using Dynamic Optimization Fabrics",
        "authors": [
            "Saray Bakker", 
            "Luzia Knoedler", 
            "Max Spahn", 
            "Wendelin Böhmer", 
            "Javier Alonso-Mora"
        ],
        "date": "2023-12-01",
        "type": "conference",
        "venue": "IEEE International Symposium on Multi-Robot & Multi-Agent Systems (MRS)",
        "links": [
            {
                "pdf": "https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=10416784",
                "code": "https://github.com/tud-amr/multi-robot-fabrics",
                "video": "https://www.youtube.com/watch?v=jaJBrSecDcM"
            }
        ],
        "image": "/assets/images/papers/multirobotfabrics/video_rf_cv_2robots.gif",
        "abstract": "In this paper, we address the problem of real-time motion planning for multiple robotic manipulators that operate in close proximity. We build upon the concept of dynamic fabrics and extend them to multi-robot systems, referred to as Multi-Robot Dynamic Fabrics (MRDF). This geometric method enables a very high planning frequency for high-dimensional systems at the expense of being reactive and prone to deadlocks. To detect and resolve deadlocks, we propose Rollout Fabrics where MRDF are forward simulated in a decentralized manner. We validate the methods in simulated close-proximity pick-and-place scenarios with multiple manipulators, showing high-success rates and real-time performance."
      },
      {
        "title": "Safe and stable motion primitives via imitation learning and geometric fabrics",
        "authors": [
            "Saray Bakker", 
            "Rodrigo Pérez-Dattari", 
            "Cosimo Della Santina",
            "Wendelin Böhmer", 
            "Javier Alonso-Mora"
        ],
        "date": "2024-11-01",
        "type": "workshop",
        "venue": "CORL, Workshop on Mastering Robot Manipulation in a World of Abundant Data",
        "links": [
            {
                "pdf": "https://openreview.net/pdf?id=xWU3Tb8JCE",
            }
        ],
        "image": "/assets/images/papers/tamedpuma/cpm.mp4",
        "key_words": [
        ],
        "abstract": "Using the language of dynamical systems, Imitation learning (IL) provides an intuitive and effective way of teaching stable task-space motions to robots with goal convergence. Yet, these techniques are affected by serious limitations when it comes to ensuring safety and fulfillment of physical constraints. With this work, we propose to solve this challenge via TamedPUMA, an IL algorithm augmented with a recent development in motion planning called geometric fabrics. We explore two variations of this approach, which we name the forcing policy method and the compatible potential method. The result is a stable imitation learning strategy within which we can seamlessly blend geometrical constraints like collision avoidance and joint limits. Beyond providing a theoretical analysis, we demonstrate TamedPUMA with simulated and real-world tasks, including a 7-DoF manipulator."
      },
      {
        "title": "Reactive grasp and motion planning for adaptive mobile manipulation among obstacles",
        "authors": [
            "Tomas Merva",
            "Saray Bakker",
            "Max Spahn",
            "Ivan Virgala",
            "Javier Alonso-Mora",
        ],
        "date": "2024-07-15",
        "type": "workshop",
        "venue": "Robotics: Science and Systems, Workshop on Frontiers of Optimization for Robotics",
        "links": [
            {
                "pdf": "https://autonomousrobots.nl/assets/files/publications/24_merva_rss.pdf"
            }
        ],
        "note": null,
        "belongs_to_projects": ["interact", "saraypapers"],
        "topics":[
            "motion planning", "grasp planning"    
        ],
        "abstract": "Mobile manipulators are susceptible to situations in which the precomputed grasp pose is not reachable as the result of conflicts between collision avoidance behaviour and the manipulation task. In this work, we address this issue by combining real-time grasp planning with geometric motion planning for decentralized multi-agent systems, referred to as Reactive Grasp Fabrics (RGF). We optimize the precomputed grasp pose candidate to account for obstacles and the robot's kinematics. By leveraging a reactive geometric motion planner, specifically geometric fabrics, the grasp optimization problem can be simplified, resulting in a fast, adaptive framework that can resolve deadlock situations in pick-and-place tasks. We demonstrate the robustness of this approach by controlling a mobile manipulator in both simulation and real-world experiments in dynamic environments."
    },
]